zhelezyaka/stm23f105-vcp/bsp/stm3210/project_full/sdcard.c
/******************** (C) COPYRIGHT 2008 STMicroelectronics ********************
 * File Name          : sdcard.c
 * Author             : MCD Application Team
 * Version            : V2.0.1
 * Date               : 06/13/2008
 * Description        : This file provides all the SD Card driver firmware
 *                      functions.
 ********************************************************************************
 * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
 * AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
 * INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
 * CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
 * INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "sdcard.h"
#include "rtthread.h"
#include "stm32f10x_sdio.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define NULL 0
#define SDIO_STATIC_FLAGS               ((u32)0x000005FF)
#define SDIO_CMD0TIMEOUT                ((u32)0x00002710)
#define SDIO_FIFO_Address               ((u32)0x40018080)

/* Mask for errors Card Status R1 */
#define SDIO_CS_ADDR_OUT_OF_RANGE        ((u32)0x80000000)
#define SDIO_CS_COM_CRC_FAILED           ((u32)0x00800000)
#define SDIO_CS_ILLEGAL_CMD              ((u32)0x00400000)
#define SDIO_CS_GENERAL_UNKNOWN_ERROR    ((u32)0x00080000)
#define SDIO_CS_ERRORBITS                ((u32)0x80C80000)

/* Masks for R4 Response */
#define SDIO_R4_CARD_RDY                ((u32)0x80000000)
#define SDIO_R4_OCR                     ((u32)0x00FFFFFF)

/* Masks for R6 Response */
#define SD_R6_GENERAL_UNKNOWN_ERROR     ((u32)0x00002000)
#define SD_R6_ILLEGAL_CMD               ((u32)0x00004000)
#define SD_R6_COM_CRC_FAILED            ((u32)0x00008000)

#define SDIO_VOLTAGE_WINDOW             ((u32)0x00180000)

#define SD_MAX_VOLT_TRIAL               ((u32)0x0000FFFF)
#define SD_ALLZERO                      ((u32)0x00000000)

#define SD_WIDE_BUS_SUPPORT             ((u32)0x00040000)
#define SD_SINGLE_BUS_SUPPORT           ((u32)0x00010000)
#define SD_CARD_LOCKED                  ((u32)0x02000000)
#define SD_CARD_PROGRAMMING             ((u32)0x00000007)
#define SD_CARD_RECEIVING               ((u32)0x00000006)
#define SD_DATATIMEOUT                  ((u32)0x000FFFFF)
#define SD_0TO7BITS                     ((u32)0x000000FF)
#define SD_8TO15BITS                    ((u32)0x0000FF00)
#define SD_16TO23BITS                   ((u32)0x00FF0000)
#define SD_24TO31BITS                   ((u32)0xFF000000)
#define SD_MAX_DATA_LENGTH              ((u32)0x01FFFFFF)

#define SD_HALFFIFO                     ((u32)0x00000008)
#define SD_HALFFIFOBYTES                ((u32)0x00000020)

/* Command Class Supported */
#define SD_CCCC_LOCK_UNLOCK             ((u32)0x00000080)
#define SD_CCCC_WRITE_PROT              ((u32)0x00000040)
#define SD_CCCC_ERASE                   ((u32)0x00000020)

#define SDIO_INIT_CLK_DIV                  ((u8)0xB2)
#define SDIO_TRANSFER_CLK_DIV              ((u8)0x1) 

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
//static u32 DeviceMode = SD_POLLING_MODE;
static u32 TotalNumberOfBytes = 0;
u32 *SrcBuffer, *DestBuffer;
volatile SD_Error TransferError = SD_OK;
vu32 TransferEnd = 0;
vu32 NumberOfBytes = 0;
SDIO_InitTypeDef SDIO_InitStructure;
SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
SDIO_DataInitTypeDef SDIO_DataInitStructure;
SDIO_CardInfo_t sd8686;
SDIO_CCCR_t cccr;
//extern struct rt_semaphore sd_read_lock, sd_write_lock;
//extern rt_bool_t sd_waiting_write;

/* Private function prototypes -----------------------------------------------*/
static void GPIO_Configuration(void);
static SD_Error SDIO_EnableWide(void);
static SD_Error SDIO_EnableProbe(void);
static SD_Error SDIO_EnableInterrupt(u8 fn);
static SD_Error SDIO_ProgFirmwareHelper(void);
static SD_Error SDIO_ProgFirmwareReal(void);
static SD_Error SDIO_IORWDirect(u8 r0w1, u8 fn, u32 regaddr, u8 in_data, u8 *out_data);
static SD_Error SDIO_WriteMultiBlock(u8 fn, u32 *writebuff, u16 BlockSize, u16 NumOfBlocks);
static SD_Error SDIO_WaitShortResp(u32 cmd, u32 *resp);
static SD_Error SDIO_ReadMultiBlock(u8 fn, u32 *readbuff, u16 BlockSize, u16 NumOfBlocks);

/* Private functions ---------------------------------------------------------*/

/*******************************************************************************
 * Function Name  : SD_Init
 * Description    : Initializes the SDIO Card, download firmware and make 88w8686
 *                  ready for data transfer).
 * Input          : None
 * Output         : None
 * Return         : SD_Error: SD Card Error code.
 *******************************************************************************/
SD_Error SD_Init(void)
{
    SD_Error errorstatus = SD_OK;

    /*
       {
       GPIO_InitTypeDef GPIO_InitStructure;

       RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

       GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_5;
       GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
       GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
       GPIO_Init(GPIOB, &GPIO_InitStructure);

       GPIO_ResetBits(GPIOB, GPIO_Pin_5) ;
       }
       */

    /* Configure SDIO interface GPIO */
    GPIO_Configuration();

    /* Enable the SDIO AHB Clock */
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_SDIO, ENABLE);

    /* Enable the DMA2 Clock */
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);

    SDIO_DeInit();

    errorstatus = SD_PowerON();

