zhelezyaka/stm23f105-vcp/bsp/stm3210/project_full/sdcard.c
    if (errorstatus != SD_OK)
    {
        /* CMD Response TimeOut (wait for CMDSENT flag) */
        return(errorstatus);
    }

    errorstatus = SD_InitializeCards();

    if (errorstatus != SD_OK)
    {
        /* CMD Response TimeOut (wait for CMDSENT flag) */
        return(errorstatus);
    }

    /* Configure the SDIO peripheral */
    /* HCLK = 72 MHz, SDIOCLK = 72 MHz, SDIO_CK = HCLK/(2 + 1) = 24 MHz */  
    SDIO_InitStructure.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV; 
    SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
    SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
    SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
    SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_1b;
    SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
    //SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Enable;
    SDIO_Init(&SDIO_InitStructure);

    /* put SDIO into 4-bit mode */
    errorstatus = SDIO_EnableWide();
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    /* enable interrupt, get ioport */
    errorstatus = SDIO_EnableProbe();
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }		    

	errorstatus = SDIO_EnableInterrupt(1);
	if (errorstatus != SD_OK) {
		return(errorstatus);
	}

    errorstatus = SDIO_ProgFirmwareHelper();
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }						    
		    
    errorstatus = SDIO_ProgFirmwareReal();
    if (errorstatus != SD_OK) {	   
        return(errorstatus);
    }				 		 	  

    return(errorstatus);		    
}

/* SDIO enable function fn */
SD_Error SDIO_EnableFunc(u8 fn)
{
    SD_Error errorstatus = SD_OK;
    u32 timeout = SDIO_CMD0TIMEOUT;
    u8 x;

    errorstatus = SDIO_IORWDirect(0, 0, SDIO_CCCR_IOEx, 0, &x);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    x |= 1 << fn;

    errorstatus = SDIO_IORWDirect(1, 0, SDIO_CCCR_IOEx, x, NULL);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    /* 
     * Loop through check IO_RDY status, until we are
     * seeing IO ready
     */
    while (1) {
        errorstatus = SDIO_IORWDirect(0, 0, SDIO_CCCR_IORx, 0, &x);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }
        /* check to see if fn is ready or not */
        if (x & (1 << fn)) {
            break;
        }
        if (timeout-- == 0) {
            errorstatus = SD_CMD_RSP_TIMEOUT;
            break;
        }
    }

    return(errorstatus);
}

/* SDIO enable interrupt on function fn */
SD_Error SDIO_EnableInterrupt(u8 fn)
{
    SD_Error errorstatus = SD_OK;
    u8 x;

    errorstatus = SDIO_IORWDirect(0, 0, SDIO_CCCR_IENx, 0, &x);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    /* enable function interrupt */
    x |= 1 << fn;

    /* enable common interrupt */
    x |= 1;

    errorstatus = SDIO_IORWDirect(1, 0, SDIO_CCCR_IENx, x, NULL);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    return(errorstatus);
}

SD_Error SDIO_GetIOPort(u8 fn, u32 *ioport)
{
    SD_Error errorstatus = SD_OK;
    u8 x;

    errorstatus = SDIO_IORWDirect(0, fn, SDIO_IOPORT, 0, &x);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    *ioport = x;

    errorstatus = SDIO_IORWDirect(0, fn, SDIO_IOPORT+1, 0, &x);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    } 

    *ioport |= (x << 8);

    errorstatus = SDIO_IORWDirect(0, fn, SDIO_IOPORT+2, 0, &x);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    } 

    *ioport |= (x << 16);

    return(errorstatus);
}

SD_Error SDIO_ReadScratch(u8 fn, u32 *scratch)
{
    SD_Error errorstatus = SD_OK;
    u8 x;

    errorstatus = SDIO_IORWDirect(0, fn, SDIO_SCRATCH, 0, &x);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }  

    *scratch = x;

    errorstatus = SDIO_IORWDirect(0, fn, SDIO_SCRATCH+1, 0, &x);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    } 

    *scratch |= (x << 8);

    return(errorstatus);
}

SD_Error SDIO_SetBlockSize(u8 fn, u32 block_size)
{
    SD_Error errorstatus = SD_OK;

    if (block_size > sd8686.max_block_size) {
        return(SD_UNSUPPORTED_FEATURE);
    }

    /* create some default value if missing input param */
    if (block_size == 0) {
        block_size = MIN(sd8686.max_block_size, sd8686.f1.max_block_size);
        block_size = MIN(block_size, 512);
    }

    errorstatus = SDIO_IORWDirect(1, 0, 
            (SDIO_FBR_BASE(fn) + SDIO_FBR_BLKSIZE), (block_size & 0xff), NULL);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    errorstatus = SDIO_IORWDirect(1, 0, 
            (SDIO_FBR_BASE(fn) + SDIO_FBR_BLKSIZE + 1), 
            ((block_size >> 8) & 0xff), NULL);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    sd8686.f1.cur_block_size = block_size;

    return(errorstatus);
}

static void delay(void)
{
  vu32 i = 0;

  for(i = 0x1000; i != 0; i--)
  {
  	__nop();
  }
}

SD_Error SDIO_WaitStatus(u8 condition)
{
    SD_Error errorstatus = SD_OK;
    u32 timeout = SDIO_CMD0TIMEOUT;
    u8 x;

    while (1) {
        /* check SDIO_STATUS */
        errorstatus = SDIO_IORWDirect(0, 1, SDIO_STATUS, 0, &x);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }
        if ((x & condition) == condition) {
            break;
        }
        if (timeout-- == 0) {
            errorstatus = SD_CMD_RSP_TIMEOUT;
            break;
        }
        delay();
    }				 

    return(errorstatus);
}

/*******************************************************************************
* Function Name  : convert_from_bytes_to_power_of_two
* Description    : Converts the number of bytes in power of two and returns the
*                  power.
* Input          : NumberOfBytes: number of bytes.
* Output         : None
* Return         : None
*******************************************************************************/
static u8 convert_from_bytes_to_power_of_two(u16 NumberOfBytes)
{
    u8 count = 0;

    while (NumberOfBytes != 1)
    {
        NumberOfBytes >>= 1;
        count++;
    }
    return(count);
}

