zhelezyaka/stm23f105-vcp/bsp/stm3210/project_full/sdcard.c
/* 
 * Caller is responsible for rounding 
 * count to 4 byte boundry
 */
SD_Error SDIO_IORWExtendReadHelper(u8 *src, u32 count)
{
    SD_Error errorstatus = SD_OK;
    u16 block_num;

    block_num = count/sd8686.f1.cur_block_size;
    errorstatus = SDIO_ReadMultiBlock(1, (u32 *)src, 
            sd8686.f1.cur_block_size, block_num);				  
						 
    return(errorstatus);
}

SD_Error SDIO_IORWExtendHelper(u8 *src, u32 count)
{
    SD_Error errorstatus = SD_OK;
    u16 block_num;

    /* First try to use multi-block copy */
    block_num = count/sd8686.f1.cur_block_size;
    errorstatus = SDIO_WriteMultiBlock(1, (u32 *)src, 
                        sd8686.f1.cur_block_size, block_num);

    return(errorstatus);
}

SD_Error SDIO_IORWExtendSendPkt(txpd_t *txpd, struct pbuf *p)
{
    SD_Error errorstatus = SD_OK;
    u16 NumOfBlocks; 	/* block size is 1, so this is TotalNumOfBytes */
    u8  power = 0;
    u16 count = 0, restwords = 0, idx = 0;
    u32 *tempbuff = (u32 *)txpd;
    u32 response_r1;
    u16 bytes_remain;
	u16 cur_buf_remain;
	u32 scratch_u32;
	u8  *scratch_u8_src_ptr;
	u8  *scratch_u8_dst_ptr;
    u8 x;
	u16 ceiling_blocks; 

	NumOfBlocks = sizeof(txpd_t) + p->tot_len;
	ceiling_blocks = (NumOfBlocks <= 0x1FF) ? (NumOfBlocks & 0x1FF) : 0;

    /* Send CMD53 IO_RW_EXTENDED */
    SDIO_CmdInitStructure.SDIO_Argument = 0x80000000 |            /* Write */
                                            ((1 & 0x7) << 28) |  /* Function number */
                                            (0x1 << 27) |         /* Block mode */
                                            (0x0 << 26) |         /* Write to fixed addr */
                                            (sd8686.f1.ioport & 0x1FFFF) << 9 |   /* Starting addr */
                                            ceiling_blocks;
    SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SDIO_RW_EXTENDED;
    SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
    SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
    SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
    SDIO_SendCommand(&SDIO_CmdInitStructure);

    /*
     * Waiting for response
     */
    errorstatus = SDIO_WaitShortResp(SDIO_SDIO_RW_EXTENDED, &response_r1);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }
    if ((response_r1 & 0xFF) != 0x00) {
        return(SD_ERROR);
    }

    bytes_remain = p->tot_len;
    power = convert_from_bytes_to_power_of_two(1);

    SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
    SDIO_DataInitStructure.SDIO_DataLength = NumOfBlocks;
    SDIO_DataInitStructure.SDIO_DataBlockSize = (u32) power << 4;
    SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
    SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
    SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
    SDIO_DataConfig(&SDIO_DataInitStructure);
    
    /* 
     * The total size is large, we had to consider
     * flow control by checking SDIO_FLAG_TXFIFOHE flag
     */
	// First we send out txpd header
	while (!(SDIO->STA & (SDIO_FLAG_TXUNDERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DATAEND | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_STBITERR)))
    {
        if (SDIO_GetFlagStatus(SDIO_FLAG_TXFIFOHE) != RESET)
        {
			SDIO_WriteData(*(tempbuff + 0));
			SDIO_WriteData(*(tempbuff + 1));
			SDIO_WriteData(*(tempbuff + 2));
			SDIO_WriteData(*(tempbuff + 3));
			SDIO_WriteData(*(tempbuff + 4));
			SDIO_WriteData(*(tempbuff + 5));
			SDIO_WriteData(*(tempbuff + 6));
			break;
        }
    }

	// Second we send out pbuf->payload
	// Assume p->total_len == T(p->len, p->next->len ...)
	tempbuff = (u32 *)p->payload; 
	cur_buf_remain = p->len;
    while (!(SDIO->STA & (SDIO_FLAG_TXUNDERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DATAEND | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_STBITERR)))
    {
        if (SDIO_GetFlagStatus(SDIO_FLAG_TXFIFOHE) != RESET)
        {
            if (cur_buf_remain >= SD_HALFFIFOBYTES)
            {
                for (count = 0; count < SD_HALFFIFO; count++)
                {
                    SDIO_WriteData(*(tempbuff + count));
                }
                tempbuff += SD_HALFFIFO;
                cur_buf_remain -= SD_HALFFIFOBYTES;
				bytes_remain -= SD_HALFFIFOBYTES;
				if (cur_buf_remain == 0) {
					if (p->next != NULL) {
						p = p->next;
						cur_buf_remain = p->len;
						tempbuff = (u32 *)p->payload;
					}
				}
            }
            else
            {
				/*
				 * The complexity here is that the size of
				 * each fragment is not guaranteed to be 4
				 * byte aligned, so we have to take care of
				 * the case when there is little tail on 
				 * current fragment, any idea to handle this?
				 */
                restwords = cur_buf_remain >> 2;
                if ((restwords << 2) != cur_buf_remain) {
					if (p->next != NULL) {
						/* 
						 * need to converage current head with
						 * the head of next fragment
						 */
						for (count = 0; count < restwords; count++) {
                			SDIO_WriteData(*(tempbuff + count));
            			}												  
						count = cur_buf_remain - ((restwords)<<2);
						bytes_remain -= (restwords)<<2;
						scratch_u8_dst_ptr = (u8 *)&scratch_u32;
						scratch_u8_src_ptr = (u8 *)(tempbuff + restwords);
						for (idx = 0; idx < count; idx++) {
							*scratch_u8_dst_ptr = *scratch_u8_src_ptr;
							scratch_u8_dst_ptr++;
							scratch_u8_src_ptr++;
						}
						p = p->next;
						count = 4 - count;
						if (p->len < count) {
							rt_kprintf("Error: tiny fragment in pbuf\n");
							return(errorstatus);
						}
						scratch_u8_src_ptr = (u8 *)p->payload;
						for (idx = 0; idx < count; idx++) {
							*scratch_u8_dst_ptr = *scratch_u8_src_ptr;
							scratch_u8_dst_ptr++;
							scratch_u8_src_ptr++;
						}
						SDIO_WriteData(scratch_u32);
						cur_buf_remain = p->len - count;
						tempbuff = (u32 *)((u8 *)p->payload + count);
						bytes_remain -= 4;
						continue;
					} else {
                		restwords++;
					}
                } 
				/* no tail, clean */
				for (count = 0; count < restwords; count++) {
                	SDIO_WriteData(*(tempbuff + count));
            	}
				bytes_remain -= cur_buf_remain;
				cur_buf_remain = 0;
            	if (p->next != NULL) {
					p = p->next;
					cur_buf_remain = p->len;
					tempbuff = (u32 *)p->payload;
				}
				/* force break out if out of bucket */
				if (bytes_remain == 0) {
					break;
				}               
            }
        }
    }
    if (NumOfBlocks > 0x1FF) {
        x = 0x01;
        errorstatus = SDIO_IORWDirect(1, 0, SDIO_CCCR_ABORT, x, NULL);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }
    }
    if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
    {
        SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
        errorstatus = SD_DATA_TIMEOUT;
        return(errorstatus);
    }
    else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
    {
        SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
        errorstatus = SD_DATA_CRC_FAIL;
        return(errorstatus);
    }
    else if (SDIO_GetFlagStatus(SDIO_FLAG_TXUNDERR) != RESET)
    {
        SDIO_ClearFlag(SDIO_FLAG_TXUNDERR);
        errorstatus = SD_TX_UNDERRUN;
        return(errorstatus);
    }
    else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
    {
        SDIO_ClearFlag(SDIO_FLAG_STBITERR);
        errorstatus = SD_START_BIT_ERR;
        return(errorstatus);
    }

    /* Clear all the static flags */
    SDIO_ClearFlag(SDIO_STATIC_FLAGS);

    /* Wait till the card is in programming state */
    errorstatus = SDIO_WaitStatus(SDIO_IO_RDY & SDIO_DL_RDY);

    return(errorstatus);    
}

