zhelezyaka/stm23f105-vcp/bsp/stm3210/project_full/sdcard.c
/*******************************************************************************
* Function Name  : SDIO_WriteMultiBlock
* Description    : Allows to write one block starting from a specified address 
*                  in a card.
* Input          : - addr: Address from where data are to be read.
*                  - writebuff: pointer to the buffer that contain the data to be
*                    transferred.
*                  - BlockSize: the SD card Data block size.
* Output         : None
* Return         : SD_Error: SD Card Error code.
*******************************************************************************/
SD_Error SDIO_WriteMultiBlock(u8 fn, u32 *writebuff, u16 BlockSize, u16 NumOfBlocks)
{
    SD_Error errorstatus = SD_OK;
    u8  power = 0;
    u32 count = 0, restwords = 0;
    u32 *tempbuff = writebuff;
    u32 response_r1;
    u32 bytes_remain;
    u8 x;
	u16 ceiling_blocks = (NumOfBlocks <= 0x1FF) ? (NumOfBlocks & 0x1FF) : 0;

    if (writebuff == NULL)
    {
        errorstatus = SD_INVALID_PARAMETER;
        return(errorstatus);
    }

    /* Send CMD53 IO_RW_EXTENDED */
    SDIO_CmdInitStructure.SDIO_Argument = 0x80000000 |            /* Write */
                                            ((fn & 0x7) << 28) |  /* Function number */
                                            (0x1 << 27) |         /* Block mode */
                                            (0x0 << 26) |         /* Write to fixed addr */
                                            (sd8686.f1.ioport & 0x1FFFF) << 9 |   /* Starting addr */
											ceiling_blocks;
                                      
    SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SDIO_RW_EXTENDED;
    SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
    SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
    SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
    SDIO_SendCommand(&SDIO_CmdInitStructure);

    /*
     * Waiting for response
     */
    errorstatus = SDIO_WaitShortResp(SDIO_SDIO_RW_EXTENDED, &response_r1);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }
    if ((response_r1 & 0xFF) != 0x00) {
        return(SD_ERROR);
    }

    TotalNumberOfBytes = NumOfBlocks * BlockSize;
    bytes_remain = TotalNumberOfBytes;
    //SrcBuffer = writebuff;
    power = convert_from_bytes_to_power_of_two(BlockSize);

    SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
    SDIO_DataInitStructure.SDIO_DataLength = TotalNumberOfBytes;
    SDIO_DataInitStructure.SDIO_DataBlockSize = (u32) power << 4;
    SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
    SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
    SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
    SDIO_DataConfig(&SDIO_DataInitStructure);

    /* IO_RW_EXTENDED does not need stop cmd */
    if (TotalNumberOfBytes <= 32*4) {
        /* 
         * If total size is no more than total TX FIFO
         * size, send them all at once
         */
        restwords = TotalNumberOfBytes >> 2;
        if ((restwords << 2) != TotalNumberOfBytes) {
            restwords += 1;
        }
        for (count = 0; count < restwords; count++) {
            SDIO_WriteData(*(tempbuff + count));
        }
        while (!(SDIO->STA & (SDIO_FLAG_TXUNDERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DATAEND | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_STBITERR))) {
            ;
        }
    } else {
        /* 
         * The total size is large, we had to consider
         * flow control by checking SDIO_FLAG_TXFIFOHE flag
         */
        while (!(SDIO->STA & (SDIO_FLAG_TXUNDERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DATAEND | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_STBITERR)))
        {
            if (SDIO_GetFlagStatus(SDIO_FLAG_TXFIFOHE) != RESET)
            {
                if (bytes_remain >= SD_HALFFIFOBYTES)
                {
                    for (count = 0; count < SD_HALFFIFO; count++)
                    {
                        SDIO_WriteData(*(tempbuff + count));
                    }
                    tempbuff += SD_HALFFIFO;
                    bytes_remain -= SD_HALFFIFOBYTES;
                }
                else
                {
                    restwords = bytes_remain >> 2;
                    if ((restwords << 2) != bytes_remain) {
                        restwords += 1;
                    }
                    for (count = 0; count < restwords; count++)
                    {
                        SDIO_WriteData(*(tempbuff + count));
                    }
                    bytes_remain = 0;
                }
            }
        }
        if (NumOfBlocks > 0x1FF) {
            x = 0x01;
            errorstatus = SDIO_IORWDirect(1, 0, SDIO_CCCR_ABORT, x, NULL);
            if (errorstatus != SD_OK) {
                return(errorstatus);
            }
        }
    }
    if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
    {
        SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
        errorstatus = SD_DATA_TIMEOUT;
        return(errorstatus);
    }
    else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
    {
        SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
        errorstatus = SD_DATA_CRC_FAIL;
        return(errorstatus);
    }
    else if (SDIO_GetFlagStatus(SDIO_FLAG_TXUNDERR) != RESET)
    {
        SDIO_ClearFlag(SDIO_FLAG_TXUNDERR);
        errorstatus = SD_TX_UNDERRUN;
        return(errorstatus);
    }
    else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
    {
        SDIO_ClearFlag(SDIO_FLAG_STBITERR);
        errorstatus = SD_START_BIT_ERR;
        return(errorstatus);
    }

    /* Clear all the static flags */
    SDIO_ClearFlag(SDIO_STATIC_FLAGS);

    /* Wait till the card is in programming state */
    errorstatus = SDIO_WaitStatus(SDIO_IO_RDY & SDIO_DL_RDY);

    return(errorstatus);
}


SD_Error SDIO_ReadMultiBlock(u8 fn, u32 *readbuff, u16 BlockSize, u16 NumOfBlocks)
{
    SD_Error errorstatus = SD_OK;
    u8  power = 0;
    u32 count = 0;
    u32 *tempbuff = readbuff;
    //u32 response_r1;
    u16 read_count = 0;
	u16 ceiling_blocks = (NumOfBlocks <= 0x1FF) ? (NumOfBlocks & 0x1FF) : 0;
	u8 x;

    if (readbuff == NULL)
    {
        errorstatus = SD_INVALID_PARAMETER;
        return(errorstatus);
    }

    TotalNumberOfBytes = NumOfBlocks * BlockSize;
    power = convert_from_bytes_to_power_of_two(BlockSize);

    SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
    SDIO_DataInitStructure.SDIO_DataLength = TotalNumberOfBytes;
    SDIO_DataInitStructure.SDIO_DataBlockSize = (u32) power << 4;
    SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
    SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
    SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
    SDIO_DataConfig(&SDIO_DataInitStructure);
					  
    /* Send CMD53 IO_RW_EXTENDED */
    SDIO_CmdInitStructure.SDIO_Argument = 0x00000000 |            /* Read */
                                            ((fn & 0x7) << 28) |  /* Function number */
                                            (0x1 << 27) |         /* Block mode */
                                            (0x0 << 26) |         /* Read from fixed addr */
                                            (sd8686.f1.ioport & 0x1FFFF) << 9 |   /* Starting addr */
                                            ceiling_blocks;
    SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SDIO_RW_EXTENDED;
    SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
    SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
    SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
    SDIO_SendCommand(&SDIO_CmdInitStructure);

    /* IO_RW_EXTENDED does not need stop cmd */
    while (!(SDIO->STA &(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DATAEND | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_STBITERR)))
    {
        if (SDIO_GetFlagStatus(SDIO_FLAG_RXFIFOHF) != RESET) {
            for (count = 0; count < SD_HALFFIFO; count++)
            {
                *(tempbuff + count) = SDIO_ReadData();
                read_count++;
            }
            tempbuff += SD_HALFFIFO;
        } else while (SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET) {
            *tempbuff = SDIO_ReadData();
            tempbuff++;
            read_count++;
        }							   
    } 
	if (NumOfBlocks > 0x1FF) {
    	x = 0x01;
        errorstatus = SDIO_IORWDirect(1, 0, SDIO_CCCR_ABORT, x, NULL);
        if (errorstatus != SD_OK) {
        	return(errorstatus);
        }
    }			 	    
    if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
    {				  
        SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
    }				 	     
    else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
    {
        SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
        errorstatus = SD_DATA_CRC_FAIL;
        return(errorstatus);
    }
    else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET)
    {
        SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
        errorstatus = SD_RX_OVERRUN;
        return(errorstatus);
    }
    else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
    {
        SDIO_ClearFlag(SDIO_FLAG_STBITERR);
        errorstatus = SD_START_BIT_ERR;
        return(errorstatus);
    }

    while (SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET)
    {
        *tempbuff = SDIO_ReadData();
        tempbuff++;
        read_count++;
    }

    /* Clear all the static flags */
    SDIO_ClearFlag(SDIO_STATIC_FLAGS);

    return(errorstatus);
}

/* Query the size indication */
SD_Error SDIO_GetNextBlockSize(u16 *block_size)
{
    SD_Error errorstatus = SD_OK;
    u32 timeout = SDIO_CMD0TIMEOUT;
    u8 x;
    u16 req_size;

    do {
        timeout--;

        errorstatus = SDIO_IORWDirect(0, 1, SDIO_RD_BASE, 0, &x);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }
        req_size = x;
        errorstatus = SDIO_IORWDirect(0, 1, SDIO_RD_BASE+1, 0, &x);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }
        req_size |= (x << 8);
        /* break out if req_size is not 0 */
        if (req_size != 0) {
            break;
        }
    } while (timeout > 0);

    if ((timeout == 0) && (req_size == 0)) {
        errorstatus = SD_CMD_RSP_TIMEOUT;
        return(errorstatus);
    }

