zhelezyaka/stm23f105-vcp/bsp/stm3210/project_full/sdcard.c
    *block_size = req_size;

    return(errorstatus);
}

/* first download sd8686_helper.bin */
SD_Error SDIO_ProgFirmwareHelper()
{
    SD_Error errorstatus = SD_OK;
    u32 scratch;
    u8  *firmware;
    u32 size;
#define BATCH_BLKSIZE 64
    u8  chunk_buffer[BATCH_BLKSIZE];
    u32 *chunk_header;
    u32 chunk_size; 
    u8 fn = 1;
    u16 next_block_size;
    u32 i;

    errorstatus = SDIO_ReadScratch(fn, &scratch);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    /* If firmware status is already running, exiting... */
    if (scratch == SDIO_FIRMWARE_OK) {
        return(errorstatus);
    }

    /* First we provision the block size */
    errorstatus = SDIO_SetBlockSize(1, 1);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    /* 
     * sd8686_helper.bin is programmed into flash,
     * starting from address 0x08000000, size 0x9D4 (2516 bytes)
     */
    firmware = (u8 *)0x08000000;
    size = 2516;
    while (size) {
        /* make sure the status is ready before dnld image */
        errorstatus = SDIO_WaitStatus(SDIO_IO_RDY & SDIO_DL_RDY);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }

        chunk_size = MIN(size, (BATCH_BLKSIZE-4));
        chunk_header = (u32 *)chunk_buffer;
        *chunk_header = (BATCH_BLKSIZE-4);
        //*chunk_header = chunk_size;

        for (i = 0; i < chunk_size; i++) {
            chunk_buffer[4+i] = *firmware;
            firmware++;
        }
        for (i = chunk_size; i < (BATCH_BLKSIZE-4); i++) {
            chunk_buffer[4+i] = 0;
        }

        errorstatus = SDIO_IORWExtendHelper(chunk_buffer, BATCH_BLKSIZE);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }

        size -= chunk_size;
    }

    /* after writing all data, write 0x00000000 as end indication */
    for (i = 0; i < BATCH_BLKSIZE; i++) {
        chunk_buffer[i] = 0x00;
    }

    errorstatus = SDIO_IORWExtendHelper(chunk_buffer, 4);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    /* check the helper status by looking at size indication */
    errorstatus = SDIO_GetNextBlockSize(&next_block_size);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    return(errorstatus);
}

/* Now download sd8686.bin */
SD_Error SDIO_ProgFirmwareReal()
{
    SD_Error errorstatus = SD_OK;
    u32 scratch;
    u8  *firmware;
    u32 size;
    //u8  chunk_buffer[64];
    //u32 *chunk_header;
    //u32 chunk_size; 
    u8 fn = 1;
    u16 next_block_size;
    u16 prev_next_block_size = 0;
    u32 retry_count;


    /* 
     * sd8686.bin is programmed into flash,
     * starting from address 0x08001000, size 0x1E024 (122916 bytes)
     */
    firmware = (u8 *)0x08001000;
    size = 122916;
    while (size > 0) {
        /* make sure the status is ready before dnld image */
        errorstatus = SDIO_WaitStatus(SDIO_IO_RDY & SDIO_DL_RDY);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }

        delay();

        if (size <= 2000) {
            size = size;
        }			   

        /* check the helper status by looking at size indication */
        errorstatus = SDIO_GetNextBlockSize(&next_block_size);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }
        if (next_block_size & 0x01) {
            retry_count = 0;
            firmware -= prev_next_block_size;
            do {			  
                next_block_size = prev_next_block_size;
                errorstatus = SDIO_IORWExtendHelper(firmware, next_block_size);
                if (errorstatus != SD_OK) {
                    return(errorstatus);
                }
                /* check the helper status by looking at size indication */
                errorstatus = SDIO_GetNextBlockSize(&next_block_size);
                if (errorstatus != SD_OK) {
                    return(errorstatus);
                }			    
                retry_count++;
            } while ((next_block_size & 0x01) && retry_count < 10);

            if (retry_count >= 10 || (next_block_size & 0x01)) {
                return(SD_ERROR);
            } else {
                firmware += prev_next_block_size;
            }
        }
        next_block_size = MIN(next_block_size, size);

        errorstatus = SDIO_IORWExtendHelper(firmware, next_block_size);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }
   			  	    
        size -= next_block_size;
        prev_next_block_size = next_block_size;
        firmware += next_block_size;
    }

    /* 
     * Now check scratch register to wait until
     * firmware is up and running
     */
    retry_count = 0;
    do {
        retry_count++;
        errorstatus = SDIO_ReadScratch(fn, &scratch);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }
        delay();
    } while (scratch != SDIO_FIRMWARE_OK && retry_count < 2000);

    if (scratch != SDIO_FIRMWARE_OK) {
        return(SD_ERROR);
    }

    return(errorstatus);
}


/* Enable interrupt, get IO port info */
SD_Error SDIO_EnableProbe()
{
    SD_Error errorstatus = SD_OK;

    errorstatus = SDIO_EnableFunc(1);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    errorstatus = SDIO_GetIOPort(1, &sd8686.f1.ioport);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    return(errorstatus);
}

/*******************************************************************************
 * Function Name  : SD_PowerON
 * Description    : Enquires cards about their operating voltage and configures 
 *                  clock controls.
 * Input          : None
 * Output         : None
 * Return         : SD_Error: SD Card Error code.
 *******************************************************************************/
SD_Error SD_PowerON(void)
{
    SD_Error errorstatus = SD_OK;

