zhelezyaka/stm23f105-vcp/bsp/stm3210/project_full/sdcard.c
    /* Power ON Sequence -------------------------------------------------------*/
    /* Configure the SDIO peripheral */
    SDIO_InitStructure.SDIO_ClockDiv = SDIO_INIT_CLK_DIV; /* HCLK = 72MHz, SDIOCLK = 72MHz, SDIO_CK = HCLK/(178 + 2) = 400 KHz */
    SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
    SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
    SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
    SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_1b;
    SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
    SDIO_Init(&SDIO_InitStructure);

    /* Set Power State to ON */
    SDIO_SetPowerState(SDIO_PowerState_ON);

    /* Enable SDIO Clock */
    SDIO_ClockCmd(ENABLE);

    return(errorstatus);
}

/*******************************************************************************
 * Function Name  : SD_PowerOFF
 * Description    : Turns the SDIO output signals off.
 * Input          : None
 * Output         : None
 * Return         : SD_Error: SD Card Error code.
 *******************************************************************************/
SD_Error SD_PowerOFF(void)
{
    SD_Error errorstatus = SD_OK;

    /* Set Power State to OFF */
    SDIO_SetPowerState(SDIO_PowerState_OFF);

    return(errorstatus);
}

SD_Error SDIO_WaitShortResp(u32 cmd, u32 *resp)
{
    SD_Error errorstatus = SD_OK;
    u32 timeout = SDIO_CMD0TIMEOUT;
    u32 status;

    *resp = 0;

    do {
        timeout--;
        status = SDIO->STA;
    } while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)) && (timeout > 0));

    if ((timeout == 0) || (status & SDIO_FLAG_CTIMEOUT)) {
        errorstatus = SD_CMD_RSP_TIMEOUT;
        SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
        return(errorstatus);
    }

    if (status & SDIO_FLAG_CCRCFAIL) {
        errorstatus = SD_CMD_CRC_FAIL;
        SDIO_ClearFlag(SDIO_FLAG_CCRCFAIL);
        return(errorstatus);
    }

    /* Clear all the static flags */
    SDIO_ClearFlag(SDIO_STATIC_FLAGS);

    /* For SEND_OP_COND command, RESPCMD should be 0x3F */
    if (cmd == SDIO_SDIO_SEN_OP_COND) {
        cmd = 0x3F;
    }

    /* Check response received is of desired command */
    if (SDIO_GetCommandResponse() != cmd)
    {
        errorstatus = SD_ILLEGAL_CMD;
        return(errorstatus);
    }

    /* We have received response, retrieve it for analysis  */
    *resp = SDIO_GetResponse(SDIO_RESP1);

    return(errorstatus);
}

SD_Error SDIO_SendIOOpCond(u32 ocr, u32 *rocr)
{
    SD_Error errorstatus = SD_OK;
    u32 response;
    u32 i;

    for (i = 3; i > 0; i--) {
        *rocr = 0;
        /* 
         * CMD5: IO_SEND_OP_COND 
         * SDIO host asks for and sets OP voltage
         * Response: R4
         *      R4_CARD_RDY
         *      R4_IO_OCR
         */
        SDIO_CmdInitStructure.SDIO_Argument = ocr;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SDIO_SEN_OP_COND;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand(&SDIO_CmdInitStructure);

        /*
         * Waiting for response
         */
        errorstatus = SDIO_WaitShortResp(SDIO_SDIO_SEN_OP_COND, &response);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }
        
        if (response & SDIO_R4_CARD_RDY) {
            errorstatus = SD_OK;
            *rocr = response & SDIO_R4_OCR;
            break;
        } else {
            errorstatus = SD_CMD_RSP_TIMEOUT;
        }
    }

    return(errorstatus);
}

SD_Error SDIO_SendRelativeAddr(u16 *rca)
{
    SD_Error errorstatus = SD_OK;
    u32 response_r1;

    SDIO_CmdInitStructure.SDIO_Argument = 0x00;
    SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SET_REL_ADDR;
    SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
    SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
    SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
    SDIO_SendCommand(&SDIO_CmdInitStructure);

    errorstatus = SDIO_WaitShortResp(SDIO_SET_REL_ADDR, &response_r1);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    if (SD_ALLZERO == (response_r1 & (SD_R6_GENERAL_UNKNOWN_ERROR | SD_R6_ILLEGAL_CMD | SD_R6_COM_CRC_FAILED)))
    {
        *rca = (u16) (response_r1 >> 16);
        return(errorstatus);
    }

    if (response_r1 & SD_R6_GENERAL_UNKNOWN_ERROR)
    {
        errorstatus = SD_GENERAL_UNKNOWN_ERROR;
    }

    if (response_r1 & SD_R6_ILLEGAL_CMD)
    {
        errorstatus = SD_ILLEGAL_CMD;
    }

    if (response_r1 & SD_R6_COM_CRC_FAILED)
    {
        errorstatus = SD_COM_CRC_FAILED;
    }

    *rca = 0;
    return(SD_ERROR);
}

SD_Error SDIO_SelectCard(u16 rca)
{
    SD_Error errorstatus = SD_OK;
    u32 response_r1;

    /* Send CMD7 SDIO_SEL_DESEL_CARD */
    SDIO_CmdInitStructure.SDIO_Argument = rca << 16;
    SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SEL_DESEL_CARD;
    SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
    SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
    SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
    SDIO_SendCommand(&SDIO_CmdInitStructure);

    errorstatus = SDIO_WaitShortResp(SDIO_SEL_DESEL_CARD, &response_r1);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    if ((response_r1 & SDIO_CS_ERRORBITS) == SD_ALLZERO)
    {
        return(errorstatus);
    }

    if (response_r1 & SDIO_CS_ADDR_OUT_OF_RANGE)
    {
        return(SD_ADDR_OUT_OF_RANGE);
    }

    if (response_r1 & SDIO_CS_COM_CRC_FAILED)
    {
        return(SD_COM_CRC_FAILED);
    }

    if (response_r1 & SDIO_CS_ILLEGAL_CMD)
    {
        return(SD_ILLEGAL_CMD);
    }

    if (response_r1 & SDIO_CS_GENERAL_UNKNOWN_ERROR)
    {
        return(SD_GENERAL_UNKNOWN_ERROR);
    }

    return(SD_ERROR);
}

SD_Error SDIO_IORWDirect(u8 r0w1, u8 fn, u32 regaddr, u8 in_data, u8 *out_data)
{
    SD_Error errorstatus = SD_OK;
    u32 response_r1;

