zhelezyaka/stm23f105-vcp/bsp/stm3210/project_full/sdcard.c
    /* Send CMD52 IO_RW_DIRECT */
    SDIO_CmdInitStructure.SDIO_Argument = (r0w1? 0x80000000 : 0x00000000) |
                                          ((fn & 0x7) << 28) |
                                          ((r0w1 && out_data)?  0x08000000 : 0x00000000) |
                                          ((regaddr & 0x1FFFF) << 9) |
                                          in_data;
    SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SDIO_RW_DIRECT;
    SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
    SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
    SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
    SDIO_SendCommand(&SDIO_CmdInitStructure);

    errorstatus = SDIO_WaitShortResp(SDIO_SDIO_RW_DIRECT, &response_r1);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    if ((response_r1 & SDIO_CS_ERRORBITS) == SD_ALLZERO)
    {
        if (out_data != NULL) {
            *out_data = response_r1 & 0xFF;
        }
        return(errorstatus);
    }

    if (response_r1 & SDIO_CS_ADDR_OUT_OF_RANGE)
    {
        return(SD_ADDR_OUT_OF_RANGE);
    }

    if (response_r1 & SDIO_CS_COM_CRC_FAILED)
    {
        return(SD_COM_CRC_FAILED);
    }

    if (response_r1 & SDIO_CS_ILLEGAL_CMD)
    {
        return(SD_ILLEGAL_CMD);
    }

    if (response_r1 & SDIO_CS_GENERAL_UNKNOWN_ERROR)
    {
        return(SD_GENERAL_UNKNOWN_ERROR);
    }

    return(SD_ERROR);
}

SD_Error SDIO_ReadCCCR(SDIO_CCCR_t *cccr)
{
    SD_Error errorstatus = SD_OK;
    u8 data;

    errorstatus = SDIO_IORWDirect(0, 0, SDIO_CCCR_CCCR, 0, &data);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    cccr->sdio_ver = (data & 0xF0) >> 4;
    cccr->cccr_ver = (data & 0x0F);

    errorstatus = SDIO_IORWDirect(0, 0, SDIO_CCCR_SD, 0, &data);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    cccr->sd_ver = data & 0x0F;

    errorstatus = SDIO_IORWDirect(0, 0, SDIO_CCCR_IORx, 0, &data);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    cccr->io_rdy = (data & 0x02) >> 1;

    errorstatus = SDIO_IORWDirect(0, 0, SDIO_CCCR_CAPS, 0, &data);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    cccr->support_direct_cmd = data & 0x01;
    cccr->support_multi_block = (data & 0x02) >> 1;
    cccr->support_4bit_int = (data & 0x10) >> 4;
    cccr->enable_4bit_int = (data & 0x20) >> 5;

    return(errorstatus);
}

SD_Error SDIO_ReadCIS(SDIO_CISTuples_t **head, u8 func_num)
{
    SD_Error errorstatus = SD_OK;
    u32 i, ptr = 0;
    u8 x;
    u8 tpl_code, tpl_link;
    SDIO_CISTuples_t *tmp_cis;

    /* get CIS base pointer */
    for (i = 0; i < 3; i++) {
        errorstatus = SDIO_IORWDirect(0, 0, 
                (SDIO_FBR_BASE(func_num) + SDIO_FBR_CIS + i), 0, &x);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }
        ptr |= x << (i * 8);
    }

    /* Now read through CIS tuples */
    do {
        /* get tuple code */
        errorstatus = SDIO_IORWDirect(0, 0, ptr++, 0, &tpl_code);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }
        /* End of Tuple list */
        if (tpl_code == 0xFF) {
            break;
        }
        
        /* allocate space for current tuple */
        if (*head == NULL) {
            *head = (SDIO_CISTuples_t *)rt_malloc(sizeof(SDIO_CISTuples_t));
            tmp_cis = *head;
            tmp_cis->next = NULL;
            tmp_cis->code = tpl_code;
            tmp_cis->size = 0;
            tmp_cis->data = NULL;
            tmp_cis->fn = func_num;
        } else {
            tmp_cis->next = (SDIO_CISTuples_t *)rt_malloc(sizeof(SDIO_CISTuples_t));
            tmp_cis = tmp_cis->next;
            tmp_cis->next = NULL;
            tmp_cis->code = tpl_code;
            tmp_cis->size = 0;
            tmp_cis->data = NULL;
            tmp_cis->fn = func_num;
        }

        /* get tuple size */
        errorstatus = SDIO_IORWDirect(0, 0, ptr++, 0, &tpl_link);
        if (errorstatus != SD_OK) {
            return(errorstatus);
        }
        tmp_cis->data = (u8 *)rt_malloc(tpl_link);
        tmp_cis->size = tpl_link;
        
        for (i = 0; i < tpl_link; i++) {
            errorstatus = SDIO_IORWDirect(0, 0, ptr++, 0, tmp_cis->data+i);
            if (errorstatus != SD_OK) {
                return(errorstatus);
            }           
        }
    } while(1);

    return(errorstatus);
}

static const unsigned char speed_val[16] =
    { 0, 10, 12, 13, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 70, 80 };
static const unsigned int speed_unit[8] =
    { 10000, 100000, 1000000, 10000000, 0, 0, 0, 0 };

SD_Error SDIO_ProcessCommonCISTuples(SDIO_CISTuples_t *head, SDIO_CardInfo_t *card_info)
{
    SD_Error errorstatus = SD_OK;

    card_info->str_info = NULL;

    /* This is common CIS */
    while (head != NULL) {
        switch (head->code) {
            case 0x15:
                /* Add some code to copy string */
                break;
            case 0x20:
                card_info->vendor = head->data[0] | (head->data[1] << 8);
                card_info->device = head->data[2] | (head->data[3] << 8);
                break;
            case 0x22:
                /* sanity check the first byte */
                if (head->data[0] != 0x00) {
                    errorstatus = SD_ERROR;
                    return(errorstatus);
                }
                card_info->max_block_size = head->data[1] | (head->data[2] << 8);
                card_info->max_speed = speed_val[(head->data[3] >> 3) & 15] *
                    speed_unit[head->data[3] & 7];
                break;
            default:
                break;
        }
        head = head->next;
    }

    return(errorstatus);
}

SD_Error SDIO_ProcessFuncCISTuples(SDIO_CISTuples_t *head, SDIO_Function_t *func)
{
    SD_Error errorstatus = SD_OK;

    /* This is per function's CIS */
    while (head != NULL) {
        switch (head->code) {
            case 0x22:
                /* sanity check the first byte should be 0x01 */
                if (head->data[0] != 0x01) {
                    errorstatus = SD_ERROR;
                    return(errorstatus);
                }
                func->wake_up_support = head->data[1] & 0x01;
                func->sdio_ver = head->data[2];
                func->card_psn = head->data[3] | (head->data[4] << 8) |
                                (head->data[5] << 16) | (head->data[6] << 24);
                func->csa_size = head->data[7] | (head->data[8] << 8) |
                                (head->data[9] << 16) | (head->data[10] << 24);
                func->csa_no_reformat = (head->data[11] & 0x02) >> 1;
                func->csa_write_prot = (head->data[11] & 0x01);
                func->max_block_size = head->data[12] | (head->data[13] << 8);
                /* FIXME 
                 * Check if there is remaining data to parse!
                 */
                
                break;
            default:
                break;
        }
        head = head->next;
    }

    return(errorstatus);
}

