zhelezyaka/stm23f105-vcp/bsp/stm3210/project_full/sdcard.c
SD_Error SDIO_EnableWide()
{
    SD_Error errorstatus = SD_OK;
    u8 x;

    errorstatus = SDIO_IORWDirect(0, 0, SDIO_CCCR_IF, 0, &x);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    x |= SDIO_BUS_WIDTH_4BIT;

    errorstatus = SDIO_IORWDirect(1, 0, SDIO_CCCR_IF, x, NULL);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    /* set STM32 SDIO to 4bit mode */
    SDIO_InitStructure.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV; 
    SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
    SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
    SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
    SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_4b;
    SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
    SDIO_Init(&SDIO_InitStructure);

    return(errorstatus);
}

/*******************************************************************************
 * Function Name  : SD_InitializeCards
 * Description    : Intialises all cards or single card as the case may be. 
 *                  Card(s) come into standby state.
 * Input          : None
 * Output         : None
 * Return         : SD_Error: SD Card Error code.
 *******************************************************************************/
SD_Error SD_InitializeCards(void)
{
    SD_Error errorstatus = SD_OK;
    u16 rca = 0x01;
    u32 ocr;
    SDIO_CISTuples_t *cis_head = NULL;
    SDIO_CISTuples_t *cis_tmp;

    /* get the op range */
    errorstatus = SDIO_SendIOOpCond(0, &ocr);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    /* set the op range */
    errorstatus = SDIO_SendIOOpCond(SDIO_VOLTAGE_WINDOW, &ocr);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    /* Send CMD3 SET_REL_ADDR with argument 0 */
    errorstatus = SDIO_SendRelativeAddr(&rca);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    errorstatus = SDIO_SelectCard(rca);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }
    
    errorstatus = SDIO_ReadCCCR(&cccr);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    /* read in common CIS and then parse common CIS */
    errorstatus = SDIO_ReadCIS(&cis_head, 0);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }
    
    errorstatus = SDIO_ProcessCommonCISTuples(cis_head, &sd8686);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    /* free cis_head */
    while (cis_head != NULL) {
        cis_tmp = cis_head->next;
        cis_head->next = NULL;
        rt_free(cis_head);
        cis_head = cis_tmp;
    }

    /* read function 1 CIS, and then parse that */
    errorstatus = SDIO_ReadCIS(&cis_head, 1);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }
    
    errorstatus = SDIO_ProcessFuncCISTuples(cis_head, &sd8686.f1);
    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    /* free cis_head */
    while (cis_head != NULL) {
        cis_tmp = cis_head->next;
        cis_head->next = NULL;
        rt_free(cis_head);
        cis_head = cis_tmp;
    }

    return(errorstatus);
}

/*******************************************************************************
 * Function Name  : SD_ProcessIRQSrc
 * Description    : Allows to process all the interrupts that are high.
 * Input          : None
 * Output         : None
 * Return         : SD_Error: SD Card Error code.
 *******************************************************************************/
SD_Error SD_ProcessIRQSrc(void)
{
	SD_Error errorstatus = SD_OK;
	u8 x;

    if (SDIO_GetITStatus(SDIO_IT_SDIOIT) != RESET)
    {
	    errorstatus = SDIO_IORWDirect(0, 1, SDIO_CCCR_INTx, 0, &x);
    	if (errorstatus != SD_OK) {
			rt_kprintf("SD_ProcessIRQSrc read interrupt status failed\n");
        	goto out;
    	}
		errorstatus = SDIO_IORWDirect(1, 1, SDIO_CCCR_INTx, ~x, NULL);
    	if (errorstatus != SD_OK) {
			rt_kprintf("SD_ProcessIRQSrc clear interrupt status failed\n");
        	goto out;
    	}
		if (x & 0x8) {
			rt_kprintf("SD_ProcessIRQSrc got overflow error\n");
			goto out;
		}
		if (x & 0x4) {
			rt_kprintf("SD_ProcessIRQSrc got underflow error\n");
			goto out;
		}
		if (x & 0x2) {
			/*
			if (sd_waiting_write == RT_TRUE) {
				//rt_sem_release(&sd_write_lock);
				rt_kprintf("SD_ProcessIRQSrc ready to download\n");
			}
			*/
		}
		if (x & 0x1) {
			//rt_sem_release(&sd_read_lock);
			//rt_kprintf("SD_ProcessIRQSrc ready to upload\n");
		}
out:
		SDIO_ClearITPendingBit(SDIO_IT_SDIOIT);
    }

    return(errorstatus);
}

/*******************************************************************************
 * Function Name  : GPIO_Configuration
 * Description    : Configures the SDIO Corresponding GPIO Ports
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
static void GPIO_Configuration(void)
{
    GPIO_InitTypeDef  GPIO_InitStructure;

    /* GPIOC and GPIOD Periph clock enable */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOD, ENABLE);

    /* Configure PC.08, PC.09, PC.10, PC.11, PC.12 pin: D0, D1, D2, D3, CLK pin */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11 | GPIO_Pin_12;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOC, &GPIO_InitStructure);	   

    /* Configure PD.02 CMD line */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_Init(GPIOD, &GPIO_InitStructure);
}

void rt_hw_sdcard_init()
{
    NVIC_InitTypeDef NVIC_InitStructure;
	SD_Error errorstatus = SD_OK;
	u8 x;

	if (SD_Init() == SD_OK) {
		rt_kprintf("Marvell 88W8686 initialize OK!\n");
	} else {
	 	rt_kprintf("Marvell 88W8686 init failed...\n");
	} 	

	/* initialize read/write semaphore */
	/*
	if (rt_sem_init(&sd_read_lock, "sd_read_lock", 0, 0) != RT_EOK)
    {
    	rt_kprintf("init sd read lock semaphore failed\n");
    }
	*/
	/*
	if (rt_sem_init(&sd_write_lock, "sd_write_lock", 0, 0) != RT_EOK)
    {
    	rt_kprintf("init sd write lock semaphore failed\n");
    }
	*/
	/* Now enable SDIO interrupt */
	/* First enable interrupt on host */
    NVIC_InitStructure.NVIC_IRQChannel = 49;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

	// STM32 is working in PIO mode, only allow
	// card to interrupt us.
	SDIO_ITConfig(SDIO_IT_SDIOIT, ENABLE);

	errorstatus = SDIO_IORWDirect(0, 0, SDIO_CCCR_IENx, 0, &x);
    if (errorstatus != SD_OK) {
        rt_kprintf("Error enable interrupt\n");
    }

	if (SDIO_IORWDirect(1, 1, SDIO_CCCR_IENx, 0x0F, NULL) != SD_OK) {
	 	rt_kprintf("Error enable interrupt\n");
	}

	if (SDIO_IORWDirect(1, 1, SDIO_HOST_INTR_MSK, 0x0F, NULL) != SD_OK) {
	 	rt_kprintf("Error enable interrupt\n");
	}

}
/******************* (C) COPYRIGHT 2008 STMicroelectronics *****END OF FILE****/
